{"Projects/Coding/GWAS-Explorer":{"slug":"Projects/Coding/GWAS-Explorer","filePath":"Projects/Coding/GWAS Explorer.md","title":"GWAS Explorer","links":[],"tags":[],"content":"Project Page\nSummary\nUpdate Frequency\nLinks"},"Projects/Coding/Ideate2D":{"slug":"Projects/Coding/Ideate2D","filePath":"Projects/Coding/Ideate2D.md","title":"Ideate2D","links":[],"tags":[],"content":"Project Page\nSummary\nUpdate Frequency\nLinks"},"Projects/Coding/SNP_manager":{"slug":"Projects/Coding/SNP_manager","filePath":"Projects/Coding/SNP_manager.md","title":"SNP_manager","links":[],"tags":[],"content":"\n\n                  \n                  The\n                  \n                \n\n\nThis python library is no longer actively maintained, but is still usable as of Python 3.11.0\n\n\n\nProject Page\nSummary\nThis is a simple library and related projects built during the August of 2024. These are made to enable faster and easier working with SNP data, with functions to export for use in other softwares such as FUMA.\nRelated projects use this library and/or other libraries to further enable plotting of SNPs or working with heat maps. Note that some of these programs may require input data to be in specific formats.\nLinks\nGitHub"},"Projects/Coding/ScreenWidgets":{"slug":"Projects/Coding/ScreenWidgets","filePath":"Projects/Coding/ScreenWidgets.md","title":"ScreenWidgets","links":[],"tags":[],"content":"Project Page\nSummary\nThis is a simple Golang UI application for task management and note-taking on-the-go for Windows 11. To use, simply install and run the .exe file, and move your mouse to the far left of the screen to get the pop-up. The pop-up disappears once the mouse leaves its area!\n\nAlternative Name: Screen++\n\n\n\nUpdate Frequency: Rare\nThis project has no set release schedule. Releases will follow addition of features/fixing of bugs.\nProject Links\nGitHub"},"Projects/Coding/Shankskit":{"slug":"Projects/Coding/Shankskit","filePath":"Projects/Coding/Shankskit.md","title":"Shankskit","links":["tags/python"],"tags":["python"],"content":"Project Page\nSummary\nA personal library of useful python functions I have found/built over the years. With most of my work centering around biology, web dev, and game dev, most of these functions focus on those areas, too.\nUpdate Frequency: Often\nThis project has no set update schedule. Releases follow feature additions and bug fixes.\nProject Links\npip install shankskit\n\nGitHub\nPyPI"},"Projects/Coding/Think-Pythonically":{"slug":"Projects/Coding/Think-Pythonically","filePath":"Projects/Coding/Think Pythonically.md","title":"Think Pythonically","links":["Website-Resources/Documents/Read-'Think-Pythonically'"],"tags":[],"content":"Project Page\nSummary\nWhile a lot of tutorials might teach you the syntax, programmers are often left to learn how they should think about the problems and the workings of Python the hard way. Memorizing syntax can only get you so far. Here, I’ve catalogued the fundamental approach I use to think about Python, while learning the syntax as a byproduct.\nUpdate Frequency: Rare\nThis is written to be as versatile and concise as possible, and thus I put in a lot of time into ensuring quality before publishing. As a result, updates can be rare.\nLinks\nRead ‘Think Pythonically’"},"Projects/Literature/Records-from-Omnisciae":{"slug":"Projects/Literature/Records-from-Omnisciae","filePath":"Projects/Literature/Records from Omnisciae.md","title":"Records from Omnisciae","links":["Website-Resources/Documents/Read-'Records-from-Omnisciae'"],"tags":[],"content":"Project Page\nProject Summary\nThis is a light-novel styled fantasy fiction story planned to run for a single issue. The entirety of the story will be published for free on this website, and at ebook websites as I can submit/get approval for them.\nUpdate Frequency: Often\nThe series has no set release schedule.\nProject Links\nRead ‘Records from Omnisciae’"},"Projects/Music/Free":{"slug":"Projects/Music/Free","filePath":"Projects/Music/Free.md","title":"Free","links":[],"tags":[],"content":"Perhaps my simplest yet most meditated piano synth composition yet!\n"},"Projects/Music/Steep":{"slug":"Projects/Music/Steep","filePath":"Projects/Music/Steep.md","title":"Steep","links":[],"tags":[],"content":"My first and perhaps most intense piano composition, made with a synth. Listen to it here, or on my Youtube page!\n"},"Projects/Music/There-Again":{"slug":"Projects/Music/There-Again","filePath":"Projects/Music/There Again.md","title":"There Again","links":[],"tags":[],"content":"Project Page\nSummary\nMy first full attempt at an English pop-song, check it out here, or on my YouTube Page!"},"Projects/Music/Unnamed":{"slug":"Projects/Music/Unnamed","filePath":"Projects/Music/Unnamed.md","title":"Unnamed","links":[],"tags":[],"content":"A classical piece I’ve spent an year constructing - and the first I’ve composed and performed on guitar!"},"Projects/Research-Papers":{"slug":"Projects/Research-Papers","filePath":"Projects/Research Papers.md","title":"Research Papers","links":[],"tags":[],"content":""},"Wander-Meadow":{"slug":"Wander-Meadow","filePath":"Wander Meadow.md","title":"Wander Meadow","links":["Projects/Coding/GWAS-Explorer","Projects/Coding/SNP_manager","Projects/Coding/Ideate2D","Projects/Coding/ScreenWidgets","Projects/Coding/Shankskit","Projects/Research-Papers","Projects/Coding/Think-Pythonically","Projects/Literature/Records-from-Omnisciae","Projects/Music/Steep","Projects/Music/Unnamed","Projects/Music/There-Again","Projects/Music/Free"],"tags":[],"content":"(Under Construction)\nHey, hi!\nI’m Shashank, and welcome to the Wander Meadow -  a garden of my digital ideas and projects. Have a wander around, see if you like something! It’s all free to use, and if you’d like to get involved, to me at my Instagram page!\nCoding\n\nGWAS Explorer | Bioinformatics Tools\nSNP_manager | Bioinformatics Python Library\nIdeate2D | Game Engine 🎮\nScreenWidgets | Utility Application\nShankskit | Personal Python Library\n\nLiterature 📖\n\nResearch Papers\nThink Pythonically | A Guide to Python\nRecords from Omnisciae | Fantasy Fiction Light Novel\n\nMusic\n\nSteep | Classical Piano Composition\nUnnamed | Classical Piano Composition\nThere Again | Pop Music in English\nFree | Classical Piano Composition\n\nArt\n\n3D modelling\n"},"Website-Resources/Documents/Read-'Records-from-Omnisciae'":{"slug":"Website-Resources/Documents/Read-'Records-from-Omnisciae'","filePath":"Website Resources/Documents/Read 'Records from Omnisciae'.md","title":"Read 'Records from Omnisciae'","links":[],"tags":[],"content":""},"Website-Resources/Documents/Read-'Think-Pythonically'":{"slug":"Website-Resources/Documents/Read-'Think-Pythonically'","filePath":"Website Resources/Documents/Read 'Think Pythonically'.md","title":"Read 'Think Pythonically'","links":[],"tags":[],"content":"Before starting this tutorial, it would help if you have python installed. However, you can use the python interface on this website that runs python code for you in the browser. Do delete the existing demo text before you begin!\nAssigning Variables\n\n\n                  \n                  Note\n                  \n                \n\n\nThis section does not produce any visible outputs. This is to learn how to think about code.\n\n\n\nYou can think of variables like boxes. You can store something in a variable, and you can store variables in other variables. It’ll make more sense once you look at the code. Variables can be named anything you like. To illustrate this point, I’ve named mine bartholomew:\nbartholomew = 5\n\nThe above line of code assigns the value of 5 to a variable named bartholomew. Now, this may sound simple enough at first, but something strange is actually going on behind the screen. Take a look at this code:\nx = 5 \ny = x \nx = 10 \n\nLooking at the above code, what do you think the value of y is once you read line 3? If you said 10, you’d be (understandably) upset to find out that the answer is 5.\nTo a programmer this may feel intuitive, obvious even, but when I first approached programming this confused me. The issue does not lie with our understanding of how variables work, but instead in understanding how the = sign works. Here is how you should be thinking of any assignment statement (think whenever = appears):\n\n\n                  \n                  Key\n                  \n                \n\n\nThis means to simplify and process as much as possible. For example, the evaluation of 2+2 would be 4.\n\n\n\nWhen you say some_variable_name = some_value, what Python does is first look at some_value as a mathematical expression to be evaluated. For example, the evaluation of 5+5 would be 10. Now how about I say “evaluate 5”? Since you’re not doing anything to the 5, you get the value 5 from evaluating it.\n\n\n                  \n                  Key\n                  \n                \n\n\nPython evaluates the expression to the right of the = and then stores the result in the variable, but does not store the expression itself.\n\n\n\nLooking back at the code example, let’s rewrite it a bit to show what the computer is thinking (lines with # are ignored by computer - these are called comments. Think of them like annotations for your code).\nx = 5 \n# computer evaluates 5 to result in 5 and stores this 5 in x \n\ny = x \n# computer evaluates x to result in 5 and stores this 5 in y \n\nx = 10 \n# computer evaluates 10 to result in 10 and stores this 10 in x \n\nNotice how the value of y does not change, despite it being defined as the value of x. This may seem trivial to begin with, but in a few chapters this trivial concept forms the lynchpin of various algorithmic possibilities.\nBut just using numbers isn’t particularly exciting, so let’s expand!\n# this is a string - a collection of ordered alphanumeric characters \nbartholomew = &quot;hi&quot; \n# computer evaluates &quot;hi&quot; to result in &quot;hi&quot; and stores this in the variable \n\nSurrounding any collection of alphanumeric characters in quotation marks makes them a string, such as “hi”, “hello”, “or even this text, yes you can store more than one word.”\nQuick question! Are x = 5 and y = &quot;5&quot; the same? Since I’m asking, you probably realise that the answer is no. And you’d be right, 5 is an integer, but “5” is string - a collection of one character (the character ‘5’).\n\n\n                  \n                  Key\n                  \n                \n\n\nAn algorithm is a set of steps. For example, “go straight, then take a right, and then the second left” is an algorithm to… I’m not sure where but you get the idea.\n\n\n\nThe print statement and some tricks\n\n\n                  \n                  Important\n                  \n                \n\n\nThis section produces visible outputs.\n\n\n\nSo far we’ve stored a value in a variable, but if you run the code you’ll notice that nothing is outputted. This is because we haven’t told python to output anything!\nA simple function to do this is called the ‘print’ function. But before we get to that, let’s take a look at what functions are!\nHow to think about functions programmatically\nA function is a machine. You give it some raw materials, it processes them, and then produces a product. The manner in which it processes them is always the same, even if you give it varying raw materials. Like a washing machine, for example! it doesn’t matter what clothes you put in it, their colour or size, they are returned in a cleaner state (hopefully) than when you put them in. Notice that the output still depends on the input, even if the steps are the same. Most importantly, if you give the same inputs, you always get the same output.\n\nIn Python, a function is a machine, and the raw materials it takes are called arguments. For example, the print function takes a string and outputs it to the console (the giant black space to the right). The writing is identical to mathematical notation. For example,\nIn mathematical notation the function f defined as\nf(x, y) = x + y \nwould mean that\nf(5, 6) = 5 + 6 \nwhich would evaluate to\nf(5, 6) = 11\nPython has the function sum. It does the same! For example, in Python\nsum(5, 6)\n\nwould evaluate to 11.\nBut wait! Run the code above. Nothing is outputted! That’s because python performs the evaluation, but doesn’t know what to do with the result yet. Let’s tell it:\nbartholomew = sum(5, 6) \n\nThis stores the result in the variable! Remember: evaluate the right hand side first! Now that we’ve stored the value, let’s tell Python to display it.\nPython has a function to do this! That’s right, functions aren’t limited to maths. The function print takes the stuff it has to display as its input:\nprint(bartholomew)\n\nThis would evaluate bartholomew to 11 and use 11 as the input. For the print function, this would be the displaying of the string “hi” in the console. Run it and see!\n\n\n                  \n                  Note\n                  \n                \n\n\nNotice how the variable is evaluated even though there is no = sign! The inputs are always evaluated first, and the result is sent to the function process! As such,\nsum(5+5, 6) \n\nWould be the same as\nsum(10, 6) # 5+5 is evaluated \n\nWhich would evaluate to\n16 \n\n\n\n\n\n\n                  \n                  Bonus\n                  \n                \n\n\nNow try print(5)! Do you get an output? Yes? Strange? After all, didn’t I say 5 is an integer, and not a string? Well, the print function automatically converts it to a string! Pretty nifty!\n\n\n\nMathematical Operators\nThe last section gave a sneak peak at this, but let’s get our heads around it anyways! First off, the basic mathematical operators remain the same:\nAddition and Subtraction\nx = 5 \ny = 10 \nz = x + y \nprint(z) \n# output should be 15 \n\nSubtraction is the simple - sign,\nx = 5 - 5 \nprint(x) # should output 0 \n\nbut division is divided into 2 forms!\nDivision\n// vs /\nEvaluating x = 11/2 results in x = 5.5\nEvaluating x = 11//2 results in x = 5\nCaught on yet? When you use //, any remainder is ignored. When you use /, it is evaluated like normal division.\nBut hey! What is 5.5? It’s not an integer, since it has a decimal value, but it’s not a string either?\nDecimal values are stored in a third form of data, called floats. You can treat them just as you would regular decimal numbers, for now.\nMultiplication and Powers\nMultiplication uses the conventional *, but putting ** means raised to the power of.\nFor example 2*5 evaluates to 10 but 2**5 evaluates to 32.\n\n\n                  \n                  Question\n                  \n                \n\n\nWhat do you think happens when a string is added to a string? For example:\nbartholomew = &quot;hi&quot; + &quot;sup&quot; \nprint(bartholomew) \n\nAnswer: The output is “hisup”! Now what about:\nbartholomew = &quot;hi&quot; + 5 \nprint(bartholomew) \n\nThe output is… an error message. Python does not allow you to add different types of data to each other (exceptions exist, such as floats and integers, like in 0.5 + 5).\n\n\n\nBasic Data Structures\nTo be added\nLoops\nTo be added"},"Website-Resources/Templates/Project-Page":{"slug":"Website-Resources/Templates/Project-Page","filePath":"Website Resources/Templates/Project Page.md","title":"Project Page","links":[],"tags":[],"content":"Project Page\nSummary\nUpdate Frequency\nLinks"}}